In [1]:
import pandas as pd

In [3]:
datos = {
    "Id_productos": [1001, 1002, 1003, 1003],
    "Cantidad_ventas": [30, None, 25, 30],
    "Precio": [20.8, 30.8, None, 0.80]
}

df = pd.DataFrame(datos)
df

   Id_productos  Cantidad_ventas  Precio
0          1001             30.0    20.8
1          1002              NaN    30.8
2          1003             25.0     NaN
3          1003             30.0     0.8

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Id_productos     4 non-null      int64
 1   Cantidad_ventas  3 non-null      float64
 2   Precio           3 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 228.0 bytes

In [9]:
df.isnull()

   Id_productos  Cantidad_ventas  Precio
0         False            False   False
1         False             True   False
2         False            False    True
3         False            False   False

In [13]:
df.isnull().sum()

Id_productos       0
Cantidad_ventas    1
Precio             1
dtype: int64

In [15]:
df_eliminado = df.dropna()
df_eliminado

   Id_productos  Cantidad_ventas  Precio
0          1001             30.0    20.8
3          1003             30.0     0.8

In [20]:
df_rellenar = df.fillna
df

   Id_productos  Cantidad_ventas  Precio
0          1001             30.0    20.8
1          1002              NaN    30.8
2          1003             25.0     NaN
3          1003             30.0     0.8

In [22]:
modificar_valores = {
    "Cantidad_ventas": 0,
    "Precio": df["Precio"].mean()
}

df_modificados = df.fillna(modificar_valores)
df_modificados

   Id_productos  Cantidad_ventas     Precio
0          1001             30.0  20.800000
1          1002              0.0  30.800000
2          1003             25.0  17.466667
3          1003             30.0   0.800000

In [25]:
df_modificados["Precio"] = df_modificados["Precio"].astype(int)
df_modificados

   Id_productos  Cantidad_ventas  Precio
0          1001             30.0      20
1          1002              0.0      30
2          1003             25.0      17
3          1003             30.0       0

In [28]:
df_juntarlos = df_modificados.drop_duplicates()
df_juntarlos

   Id_productos  Cantidad_ventas  Precio
0          1001             30.0      20
1          1002              0.0      30
2          1003             25.0      17
3          1003             30.0       0

In [30]:
df_juntarlos = df_modificados.drop_duplicates(subset="Id_productos")
df_juntarlos

   Id_productos  Cantidad_ventas  Precio
0          1001             30.0      20
1          1002              0.0      30
2          1003             25.0      17